src/main/resources/request/SendUpdateJobHeaderRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:opt="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd" xmlns:opt1="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendUpdateJobHeaderRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:UpdateJobHeaderRequest>
                <opt:JobHeader>
                    <opt1:JobIdentity>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:JobIdentity>
                    <!--Optional:-->
                    <opt1:Contact>
                        <!--Optional:-->
                        <opt1:Title>?</opt1:Title>
                        <opt1:Name>?</opt1:Name>
                        <!--Optional:-->
                        <opt1:HomePhone>?</opt1:HomePhone>
                        <!--Optional:-->
                        <opt1:WorkPhone>?</opt1:WorkPhone>
                        <!--Optional:-->
                        <opt1:MobilePhone>?</opt1:MobilePhone>
                        <!--Optional:-->
                        <opt1:Email>?</opt1:Email>
                        <!--Optional:-->
                        <opt1:URL>?</opt1:URL>
                        <!--Optional:-->
                        <opt1:ContactExtension>
                            <!--Optional:-->
                            <com:PreferredName>?</com:PreferredName>
                            <!--Optional:-->
                            <com:ID>?</com:ID>
                            <!--Optional:-->
                            <com:IDLabel>?</com:IDLabel>
                            <!--Optional:-->
                            <com:DateOfBirth>?</com:DateOfBirth>
                            <!--Optional:-->
                            <com:DateOfDeath>?</com:DateOfDeath>
                            <!--Optional:-->
                            <com:Gender>?</com:Gender>
                        </opt1:ContactExtension>
                    </opt1:Contact>
                    <!--Optional:-->
                    <opt1:Description>?</opt1:Description>
                    <!--Optional:-->
                    <opt1:SpecialInstructions>?</opt1:SpecialInstructions>
                    <!--Optional:-->
                    <opt1:DueDate>?</opt1:DueDate>
                    <!--Optional:-->
                    <opt1:DueStart>?</opt1:DueStart>
                    <!--Optional:-->
                    <opt1:DueEnd>?</opt1:DueEnd>
                    <!--Optional:-->
                    <opt1:Duration>?</opt1:Duration>
                    <!--Optional:-->
                    <opt1:Skills>
                        <!--Zero or more repetitions:-->
                        <opt1:Skill>?</opt1:Skill>
                    </opt1:Skills>
                    <!--Optional:-->
                    <opt1:AllocatedTo>
                        <opt1:Username>?</opt1:Username>
                    </opt1:AllocatedTo>
                    <!--Optional:-->
                    <opt1:AppointmentDate>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </opt1:AppointmentDate>
                    <!--Optional:-->
                    <opt1:GroupReference>?</opt1:GroupReference>
                    <!--Optional:-->
                    <opt1:Attributes>
                        <!--Zero or more repetitions:-->
                        <opt1:NameValueAttribute>
                            <opt1:Name>?</opt1:Name>
                            <opt1:Value>?</opt1:Value>
                        </opt1:NameValueAttribute>
                    </opt1:Attributes>
                    <!--Optional:-->
                    <opt1:AdditionalProperties>
                        <!--Zero or more repetitions:-->
                        <vis:AdditionalProperty>
                            <vis:Name>?</vis:Name>
                            <vis:Value>?</vis:Value>
                            <!--Optional:-->
                            <vis:AdditionalProperties/>
                        </vis:AdditionalProperty>
                    </opt1:AdditionalProperties>
                    <!--Optional:-->
                    <opt1:MandatoryResource>
                        <opt1:Username>?</opt1:Username>
                    </opt1:MandatoryResource>
                    <!--Optional:-->
                    <opt1:PreferredResources>
                        <!--Zero or more repetitions:-->
                        <opt1:ResourceIdentity>
                            <opt1:Username>?</opt1:Username>
                        </opt1:ResourceIdentity>
                    </opt1:PreferredResources>
                    <!--Optional:-->
                    <opt1:ProhibitedResources>
                        <!--Zero or more repetitions:-->
                        <opt1:ResourceIdentity>
                            <opt1:Username>?</opt1:Username>
                        </opt1:ResourceIdentity>
                    </opt1:ProhibitedResources>
                </opt:JobHeader>
            </mes:UpdateJobHeaderRequest>
        </mes:SendUpdateJobHeaderRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>